[
    {
        "description": "Bulbasaur is a potent sweeper in the LC metagame, as Z-Celebrate allows it to clean mid- or late-game and sweep unprepared teams with ease. Additionally, its Z-Celebrate-boosted bulk and access to Sleep Powder allow it to take some hits from strong Pokemon or immobilize them after setting up, since its good defensive typing gives it some key resistances, such as Fighting, Fairy, and Water. Unfortunately, Bulbasaur is frail and weak without the Z-Celebrate boosts, and it lacks setup opportunities against most of the Pokemon in the metagame since it is weak to common types such as Psychic and Flying. Bulbasaur also has a bad movepool and has to rely on Hidden Power Fire to do significant damage to Steel- and Poison-types, even with a Z-Celebrate boost, which can only be obtained once. Bulbasaur is also outsped by common Choice Scarf users such as Doduo and Rufflet. Bulbasaur also faces competition with Pumpkaboo-S, as both can use Z-Moves to boost all of their stats, and Z-Trick-or-Treat is obviously more useful than Z-Celebrate."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Venusaur is an excellent choice for sun teams, as it packs a good Speed tier, offensive stats, and most importantly, bulk. It also has useful moves such as Growth and Sleep Powder to break teams by boosting up or putting a check out of commission. Venusaur is exclusively a choice for sun teams, as it is outclassed by Roserade and Shaymin otherwise. Moreover, Venusaur gets completely walled by offensive Dragon-types such as Dragalge and Goodra. These threats get a free switch into Venusaur and can threaten its team. Despite its doubled Speed in sun, Venusaur can still be offensively checked by threats such as Choice Scarf Trace Gardevoir and priority from Golisopod and Zygarde-10% if it is chipped enough by entry hazards and Life Orb recoil."
    },
    {
        "description": "Charmander might look like a good Pokemon to use due to its movepool and access to Dragon Dance, but its power output is disappointing even with using Life Orb to get the most out of its attacks. It is outclassed by other Fire-types like Ponyta, Larvesta, and Magby due to their better Attack, Speed, and bulk."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Mega Charizard X is an extremely strong wallbreaker and setup sweeper that can offensively pressure key Steel- and Grass-types such as Magearna, Ferrothorn, and Tangrowth. Its great offensive typing after Mega Evolving and strong STAB options boosted by Tough Claws allow it to break past most of the metagame with near-unresisted STAB and coverage options. Mega Charizard X's good Speed tier enables it to outpace fast foes such as Tapu Lele, Kyurem-B, and Gliscor, giving it the edge over other slower wallbreakers. Access to Dragon Dance makes Mega Charizard X extremely threatening after a boost, outspeeding even some Choice Scarf users like Landorus-T. However, it is extremely susceptible to entry hazards; before Charizard Mega Evolves, it is 4x weak to Stealth Rock and struggles to effectively switch in, and after Mega Evolving it becomes vulnerable to all forms of entry hazards. Furthermore, it is also chipped down by residual damage like Rocky Helmet from Tornadus-T and Iron Barbs from Ferrothorn as well as taking substantial Flare Blitz recoil to deal with these foes, which limits its ability to break these Pokemon without being worn down into range of faster attackers or priority itself."
    },
    {
        "description": "Squirtle's diverse movepool, including support moves such as Fake Out and Rapid Spin, makes it seem appealing, but its lackluster stats hold it back from ever being useful in Little Cup. All of its possible sets are outclassed by other, better Water-types such as Staryu and Corphish, with any niches it has over these Pokemon being small or insignificant. Squirtle is a pretty terrible Pokemon in general and doesn't fit on nearly any team."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Mega Blastoise is one of RU's best spinners, giving it an important place on many offensive and balanced teams. Its high Special Attack and excellent Mega Launcher-boosted coverage make it a pain for offensive teams to switch into, and between the switches its prowess forces and the passive walls that teams often use to check it, it finds many opportunities to spin. Having Dark Pulse to keep Ghost-types from safely spinblocking and outspeeding common coverage-weak Stealth Rock setters in Bronzong, Nidoqueen, and Rhyperior make its job even easier. Its good natural bulk enables it to take at least one strong neutral hit to deal massive damage back or do one last spin. Mega Blastoise's greatest flaw is its complete lack of recovery; this issue combined with its susceptibility to all forms of entry hazards and status leads to it inevitably getting worn down. Its average Speed tier renders it easy to offensively pressure, especially since switching in to spin several times will put it in KO range of many faster attackers. It faces a lot of competition from Donphan as a spinner and from the likes of Golisopod, Araquanid, and Slowbro as a Water-type with unique utility."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "While Butterfree's decent Special Attack and access to Quiver Dance and Tinted Lens are appealing, there's little reason to use it over more consistent setup sweepers such as Omastar, Oricorio-G, and Bellossom. Its middling Speed leaves it outsped, even at +1 Speed, by common Choice Scarf users like Primeape and Kabutops that can easily dispose of it. Its typing also makes it susceptible to Stealth Rock and common attacking types in Flying and Electric, and its poor bulk makes it almost impossible to successfully set up with Quiver Dance."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "By virtue of amazing offensive stats and Adaptability, Mega Beedrill is among the best offensive pivots available. Its typing allows it to provide heavy offensive pressure to common Pokemon such as Primarina and Latias, while its access to good coverage options like Drill Run and Knock Off lets it hit the majority of the tier quite hard. Mega Beedrill also has access to Toxic Spikes, which it can use as it forces switches to wear down opposing Pokemon. However, Mega Beedrill has atrocious bulk, which leaves it vulnerable to Choice Scarf users, strong priority, and the ever-present Mega Aerodactyl. Its Stealth Rock-weak typing also keeps it from properly functioning as a pivot without an entry hazard remover on its team, thus complicating building with Mega Beedrill at times. Lastly, Mega Beedrill struggles to break past a few big presences in the tier, including Hippowdon, Scizor, and Mega Aerodactyl, due to its only decent coverage."
    },
    {
        "description": "Pidgey is unviable in the Little Cup metagame due to its poor stats, mediocre typing, and average movepool. While other Flying-types may find a niche due to useful abilities or high stats, Pidgey has nothing to warrant including it over another Flying-type on any competitive team. Its stats and movepool leave it completely outclassed by Doduo, Vullaby, and Rufflet, among others."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Mega Pidgeot's great Speed tier, amazing offensive typing in Flying, and solid Special Attack make it a threatening attacker. No Guard gives Mega Pidgeot a 100% accurate Hurricane, which means it has something many special attacking Flying-types lack: a reliable, strong STAB move. Flying as an offensive typing is great, as few types resist it, although the types it hits super effectively are not very common. Mega Pidgeot also has solid coverage in Heat Wave, pivoting abilities in U-turn, and reliable recovery in Roost, giving it decent longevity and allowing it to fit on VoltTurn teams. Mega Pidgeot's flaws lie in its mediocre defensive typing, giving it very few useful resistances and a crippling weakness to Stealth Rock; its bulk is good enough to survive most neutral attacks, but not with Stealth Rock up, making entry hazard removal a priority on Mega Pidgeot teams. The high usage of Electric-types such as Mega Manectric do Mega Pidgeot no favors either, as they resist its STAB attack and deal heavy damage in return with Volt Switch or OHKO with Thunderbolt. While No Guard gives Mega Pidgeot an accurate Hurricane, it also makes every inaccurate move hit Mega Pidgeot itself, which means it cannot dodge moves such as Stone Edge, Toxic, and Icicle Crash. It also faces indirect competition from other Mega Evolutions, such as Mega Aerodactyl and Mega Sharpedo, which are often faster and stronger than Mega Pidgeot."
    },
    {
        "description": "Rattata's decent Speed tier and high Attack stat along with Hustle and several coverage options may make it sound like a good breaker which dismantles many teams on paper, but in practice it is quite frail and gets easily revenge killed by priority moves such as Mach Punch from Timburr and Sucker Punch from Pawniard. Its heavy reliance on Hustle makes Rattata an unoptimal breaker, as it depends on accuracy to land some important hits. As such, Rattata is outclassed by Rufflet as a Hustle wallbreaker due to Rufflet's higher Attack, better bulk, ability to set up, and better STAB attacks, and Bunnelby, which has Huge Power and better coverage options."
    },
    {
        "description": "Even if Raticate's nice Speed, decent Attack, and access to Guts all seem like reasons to use it, it is sadly outclassed by Normal-type wallbreakers such as Kangaskhan, Stoutland, Alolan Raticate, and Zangoose. Its mediocre bulk and typing leave it susceptible to Mach Punch, one of the most common priority moves in the tier, as well as faster attackers. It also often lacks the firepower to break through walls like Regirock and Jellicent."
    },
    {
        "description": "Spearow offers little to nothing to distinguish itself from the myriad of Flying-type Pokemon in the tier and struggles to find a place on any serious team as a result. Access to Drill Run is appealing at face value, as it gives Spearow a tool to hit Rock- and Steel-type checks such as Onix and Magnemite hard, but similar Pokemon like Doduo and Rufflet carry moves such as Jump Kick and Superpower to deal with such Pokemon. These two Pokemon are also Spearow's most notable examples of competition, as they boast better offensive stats, access to Brave Bird, more powerful coverage moves, and in Rufflet's case, a far more useful ability in Hustle. Lastly, Spearow's paltry defenses and weaknesses to common Electric-, Rock-, and Ice-type attacks all contribute to its poor longevity."
    },
    {
        "description": "Fearow has a multitude of issues in pitiful bulk, average offensive stats, a weakness to Stealth Rock, and a reliance on critical hits to shore up its low-powered attacks, which makes its damage output inconsistent. It is also hopelessly outclassed by the likes of Dodrio and Scyther due to their access to Swords Dance, better Speed tiers, and better bulk, the former having a much stronger Flying-type STAB move and the latter sporting U-turn as well. Fearow's access to Ground-type coverage and ability to take advantage of critical hits, especially inconsistently, are not enough to save it from being an awful choice in the metagame."
    },
    {
        "description": "Ekans carves itself a niche in LC as the only viable Coil sweeper, and it has quite an offensive presence after Coil boosts. Its expansive movepool includes many coverage moves like Earthquake and Sucker Punch to hit specific threats as well as utility options like Glare, and its typing grants it resistances to common Fighting-type moves as well as Fairy- and Poison-type moves, allowing it to check Pokemon like Timburr, Mienfoo, Spritzee, and Foongus. Furthermore, Ekans has great abilities in Intimidate, which lowers the foe's Attack, and Shed Skin, which can cure Ekans of status, easing its setup opportunities. These traits allow it to function well on offensive teams. Unfortunately, Ekans is fairly weak without Coil boosts, meaning it is easily played around. Ekans's main STAB move, Gunk Shot, has very low PP, so it has to worry about that when sweeping. Its typing leaves it vulnerable to common Ground-types like Diglett, which can trap and OHKO Ekans, as well as Mudbray and Onix. Ekans also is somewhat slow, so its sweeps can be stopped by fast, powerful attackers like Gastly and Abra. Lastly, Ekans faces competition from other Poison-types like Alolan Grimer and Croagunk, with the former having Poison Touch, Knock Off, and a better typing and the latter having a better typing, more setup opportunities, and greater power."
    },
    {
        "description": "Despite not suffering from competition as a Coil user having decent abilities and a nice movepool, Arbok struggles to find its place. Its only average Attack and Speed and mediocre bulk make it a bad setup sweeper, give it a hard time setting up, and leave it easily revenge killed and walled by metagame staples, such as Oricorio-E and Jellicent."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "The main reason to not use Raichu is the fact that it is completely outclassed by its brother, Alolan Raichu. This is due to Alolan Raichu's secondary typing that allows it to hit Pokemon like Victreebel and Clefairy much harder and resist Mach Punch. While Raichu's lack of a secondary typing may seem to give it a better matchup against Sucker Punch and Pursuit users like Skuntank, its poor defensive stats lead to Raichu still taking a lot from both."
    },
    {
        "description": "With its new Alolan forme, the original Sandshrew has been greatly overshadowed, even more than it already was, in fact. However, Sandshrew can still use Knock Off and has a much better defensive typing. It is also largely outclassed by Drilbur in its role as a Stealth Rock and Rapid Spin user, though it has a higher Defense stat and access to the previously mentioned Knock Off. Furthermore, with the rise of Staryu, Sandshrew has become even more niche due to Staryu's ability to clear away Sandshrew's hazards and completely force it out with the threat of a Scald."
    },
    {
        "description": "Sandslash is a spinner that is outclassed by many other Pokemon within the PU tier. Alolan Sandslash has a useful Ice / Steel typing, and Slush Rush lets it fit well with Aurorus, while Hitmonchan has access to priority and greater moveset flexibility. Sandslash is also outclassed by Silvally-Fairy, Silvally-Dragon, and Silvally-Water, which have the added bonus of Parting Shot, and Skuntank, which can hit Ghost-types super effectively and Pursuit trap. Sandslash is also hindered by many of the tier's Ghost-types such as Oricorio-E and Jellicent, which can set up against it, burn it with Will-O-Wisp, or hit it super effectively."
    },
    {
        "description": "Although it has access to Toxic Spikes, Nidoran-F is entirely outclassed as a defensive Toxic Spikes setter by Mareanie and Koffing, which boast better bulk. Other Poison-type Pokemon such as Foongus and Alolan Grimer also outclass it defensively and offensively as well. As such, Nidoran-F is bad and shouldn't be used."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Nidoqueen is an excellent offensive Stealth Rock setter and wallbreaker thanks to its strong Life Orb- and Sheer Force-boosted attacks and its access to Taunt and Toxic. Its effectiveness as a Stealth Rock setter is bolstered by the fact that it beats almost every entry hazard remover in the tier thanks to its impeccable coverage. Nidoqueen's typing gives it an immunity to Electric and useful resistances that allow it to check common Pokemon. However, Nidoqueen's average Speed tier prevents it from outpacing common Pokemon such as Necrozma, Goodra, and Roserade. Nidoqueen also struggles to beat walls like Milotic, Cresselia, and Umbreon unless running Toxic or niche coverage moves. For example, it can run Thunderbolt for Milotic or Focus Blast for Umbreon. However, Nidoqueen can still struggle to break through Pokemon even when running the appropriate coverage attack; one case of this is relying on the inaccurate Focus Blast to break through Pokemon like Snorlax and the aforementioned Umbreon."
    },
    {
        "description": "While Nidoran-M may look worthwhile due to Hustle boosting its attack, it suffers from a terrible Speed stat, poor defenses, and a horrible offensive typing. Even with its high Attack, Nidoran-M is unable to break through a majority of walls without extensive setups and is heavily reliant on Sucker Punch to hit faster targets, which is easily exploitable by the bevy of faster Fighting- and Dark-types in the tier. Because of this, other, stronger wallbreakers such as Croagunk, Rufflet, and Pawniard are much more useful, as they have much better speed, bulk, and STAB attacks to allow them to to break through opposing teams."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Nidoking's amazing offensive typing combined with its ability Sheer Force turns it into a very powerful wallbreaker in the UnderUsed tier. Between its STAB moves and Ice Beam, Nidoking is able to hit the majority of the tier super effectively, meaning it has a very flexible last moveslot for another option such as Substitute or Taunt. By virtue of its typing, Nidoking is able to check Pokemon like Tentacruel and Primarina offensively and switch into Pokemon like Klefki and Zeraora with ease. Furthermore, Nidoking sets itself apart from its counterpart, Nidoqueen, thanks to its better Speed tier and better overall offensive capabilities. However, its average Speed tier makes it slower than Pokemon like Latias, Hydreigon, and Krookodile, meaning it can be easily revenge killed. It's also held back by its weakness to common typings in Ground, Psychic, Water, and Ice, making it easily exploitable by Pokemon like Krookodile, Latias, Starmie, and Kyurem. Nidoking's mediocre bulk also makes it hard for it to find opportunities to switch in."
    },
    {
        "description": "As a result of Clefairy’s solid Eviolite-augmented bulk and access to reliable recovery in Soft-Boiled, Clefairy is capable of functioning as an effective check to many threatening special attackers, such as Rotom-F and Silvally-Dragon. Clefairy also has access to a stellar defensive ability in Magic Guard, which blocks all forms of passive damage, making it immune to entry hazards and allowing it to act as a status absorber, which is particularly useful for Calm Mind sets. On top of this, Clefairy boasts an amazing support movepool, with moves such as Knock Off, Stealth Rock, and Thunder Wave in its arsenal, making Clefairy one of few Pokemon in the tier to have both Stealth Rock and recovery. Unfortunately, Clefairy is heavily reliant on its Eviolite to check most special attackers due to its otherwise below-average bulk, making it vulnerable to Knock Off and thus shaky as a Dark-type check. Even with its Eviolite intact, Clefairy is unfortunately unable to reliably switch into many of the stronger special attackers in the tier such as Aurorus, Jellicent, and Drampa, and struggles against strong physical attackers such as Stoutland and Golurk as a result of its poor physical bulk. In addition, Clefairy's passive nature and Fairy-typing unfortunately leaves it helpless against a variety of threatening wallbreakers including Victreebel and Aggron, and often gives these Pokemon free entry. As a result, Clefairy is largely restricted to bulkier, more defensive teams, where these weaknesses can be patched up."
    },
    {
        "description": "Clefable's decent bulk, reliable recovery, and fantastic defensive typing allow it to act as a solid check to Pokemon like Garchomp, Mega Medicham, Mega Lopunny, and Hawlucha, making it a valuable defensive Pokemon in the tier. It also has access to two fantastic abilities in Magic Guard and Unaware, sprouting into several different sets. Defensive Magic Guard Clefable provides wonderful utility to bulky offensive and balanced teams thanks to its ability to act as a status absorber and use moves like Stealth Rock, Calm Mind, and Thunder Wave. Magic Guard can also be run on an offensive set utilizing Life Orb and Clefable's fantastic coverage, trading most of its defensive capabilities to turn it into a terrifying wallbreaker with very few switch-ins. Unaware Clefable, on the other hand, is a great asset to stall teams thanks to its ability to stop setup sweepers in their tracks with the ability to ignore their boosts. Furthermore, with Calm Mind, it can beat setup sweepers that it wouldn't be able to otherwise such as Swords Dance Gliscor, Calm Mind Reuniclus, and Calm Mind Blacephalon, all of which are big threats to the stall archetype. These boons and the fact that it can also heal status with Heal Bell and pass Wish to its teammates make Unaware Clefable a stall team mainstay. However, Clefable does have its own shortcomings. Its rather lackluster offensive presence if not running Life Orb means it invites a plethora of dangerous wallbreakers such as Heatran, Magearna, Mega Mawile, Tapu Bulu, and Volcarona, although Clefable's expansive moveset means these Pokemon can be surprised by moves like Thunder Wave and Fire Blast. Additionally, its bulk is quite mediocre for a defensive Pokemon, making it prone to losing to the Pokemon it is supposed to check if it is chipped even slightly."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Ninetales is a threatening wallbreaker thanks to its Drought ability and ability to threaten switch-ins with Nasty Plot or Choice Specs-boosted attacks. It also gets great coverage in Solar Beam to beat Water- and Rock-types and Hidden Power Ice for Noivern and Flygon. Also, Drought combined with its good special bulk makes Ninetales more effective against Water-types than any of its competitors. However, while Ninetales has decent Speed, it still is vulnerable to faster attackers such as Zygarde-10% and Choice Scarf Tyrantrum, which can revenge kill it. Ninetales also faces stiff competition from similar attackers like Salazzle, which can also utilize Nasty Plot and has better Speed, better Special Attack, and a secondary type for coverage."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "It may have a very large movepool that includes support options like Stealth Rock, a gigantic HP stat, and a unique typing in PU, but Wigglytuff constantly finds itself outclassed by other defensive Normal- and Fairy-types such as Audino, Clefairy, and Silvally-Fairy thanks to their better stats overall. This relegates it to being an offensive Stealth Rock user that can pressure Defog users with decent neutral coverage. However, Wigglytuff's middling defenses, mediocre firepower, and horrendous Speed make using it difficult. Wigglytuff also has to compete against other offensive Stealth Rock setters such as Aggron and Aurorus thanks to their better stats, typings, abilities, and ability to actually pressure Defoggers such as Skuntank."
    },
    {
        "description": "Zubat has abysmal stats and a movepool that is not much better. Zubat is impressively weak even with Brave Bird, and it is so frail that even switching into Fighting-types and their coverage moves is difficult. Similarly, despite being a Poison-type, Zubat struggles to even beat Snubbull and Spritzee, as it lacks a viable Poison-type STAB move. With Vullaby, Doduo, and Rufflet available in the tier, there is no reason to attempt to use Zubat, as they are all much stronger."
    },
    {
        "description": "With its excellent bulk with Eviolite, great defensive typing, and reliable recovery, Golbat finds its place on teams that require checks to offensive Pokemon like Sceptile and Passimian. Additionally, the utility that Defog offers gives it a place on teams that require entry hazard control. Golbat possesses a great Speed tier, allowing it to outspeed and deal with threats like Decidueye and Medicham. Utility options in Super Fang, Toxic, and Taunt offer Golbat a wide range of stallbreaking options against Pokemon like Vaporeon, Mega Audino, and Silvally-Steel. However, Golbat's weakness to Stealth Rock leaves it susceptible to being pressured and forced to Roost frequently, which also makes it less effective as a hazard remover. Golbat's heavy reliance on Eviolite leaves it vulnerable to being exploited by Pokemon it used to be able to check, like Sceptile and Fighting-types, when it has been hit by Knock Off. Golbat's passive nature leaves it prone to being pivoted on and taken advantage of by Pokemon like Steelix, Klinklang, and Rotom."
    },
    {
        "description": "While Oddish has decent stats going for it as well as a powerful utility move in Strength Sap, it is not viable due to the lack of a good ability, and it faces heavy competition in any role it wants to fulfill. It is fully outclassed by Foongus as a bulky Grass-type due to Regenerator and better bulk, as well as Morelull due to Effect Spore and its better matchup against Fighting-types. Even in sun, which isn't viable either, Bulbasaur and Bellsprout completely outclass it due to better offensive presence, higher Speed stats, and the ability to set up."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "While Vileplume has a unique move in Strength Sap and access to Effect Spore to allow it to barely check common physical attackers like Zygarde-10%, Virizion, and Golisopod, it is largely outclassed as a defensive Grass-type by Tangela, which has much higher bulk thanks to Eviolite, a better defensive ability in Regenerator, and access to moves like Knock Off and Leech Seed."
    },
    {
        "description": "Paras is weak, frail, slow, and cursed with a poor typing that leaves it weak to common Ice-, Flying-, and Rock-type attacks, though it is resistant to Fighting-type attacks. It does have two very useful moves in Spore and Knock Off, but unfortunately for Paras, Foongus exists and has a much better typing, better bulk, and a neutrality to Stealth Rock."
    },
    {
        "description": "Parasect's access to the rare Spore and a solid ability in Dry Skin cannot make up for the several crippling flaws it has in the PU metagame. It is absurdly slow, has lackluster bulk, and has an awful defensive typing; it is notably 4x weak to Flying and weak to Rock-, Ice-, and Poison-type attacks as well, which are all common in the PU metagame. Most of what Parasect can attempt to do, other Grass-types can do a lot better. Tangela has access to Regenerator and better bulk via Eviolite, Roselia has access to entry hazards and a solid secondary typing in addition to Eviolite, and Ferroseed has a far better typing and also can set entry hazards. In general, these Grass-types also lack the aforementioned problems that come with Parasect's Bug typing."
    },
    {
        "description": "Venonat offers no real competitive value and is outclassed by Foongus or Morelull. Its biggest draw is a 4x resistance to Fighting-type attacks, which can be quite useful with Fighting-types playing such a big role in Little Cup. It also has access to Compound Eyes and Sleep Powder, which lends some nice support, although Foongus or Morelull would probably be a better choice overall."
    },
    {
        "description": "Albeit uncommon, Venomoth is among UU's most potent sweepers thanks to its access to Quiver Dance, Sleep Powder, and an amazing ability in Tinted Lens, which severely limits its checks. The advent of Z-Moves allows Venomoth to further bolster its sweeping prowess, as it can use Savage Spin-Out to break past Pokemon capable of tanking a +1 Bug Buzz like Scizor and Terrakion. Venomoth also possesses key resistances to the tier's common Fairy- and Fighting-type attacks, which grants it plentiful opportunities to force switches and set up. Unfortunately, despite its useful resistances, Venomoth's typing also leaves it with a Stealth Rock weakness and with vulnerabilities to common attack types in Fire, Flying, and Psychic. Venomoth is also cursed with horrid bulk, which can complicate setup and leave it vulnerable to Choice Scarf users like Infernape and Krookodile. Venomoth can also struggle due to its occasionally underwhelming power after one Quiver Dance boost, which may leave it reliant on setting up a second time or using its Z-Move too early."
    },
    {
        "description": "Despite poor defensive stats and mediocre offensive stats, Diglett is one of the defining Pokemon of the Little Cup metagame thanks to its ability Arena Trap, which allows it to revenge kill grounded Pokemon without giving them the option to switch out. Diglett is helped in its revenge killing by a high Speed stat, which allows it to tie for the fastest unboosted Pokemon in the metagame, and a useful offensive typing that gives it super effective STAB coverage on a wide variety of Pokemon. Its moveset is also somewhat customizable, with its movepool including options such as Sucker Punch and Sludge Bomb, allowing it to, for the most part, trap and take on whatever Pokemon its team needs removed. A wide variety of support moves are also at its disposal, allowing Diglett to support its team after trapping the Pokemon it aims to eliminate."
    },
    {
        "description": "Dugtrio, although one-dimensional, finds its niche in the Ubers tier as a trapper that can reliably OHKO Magearna and offensive variants of Primal Groudon and Necrozma-DM."
    },
    {
        "description": "Meowth carves itself a niche as an excellent revenge killer with its Fake Out + Feint combination, which is considerably powerful thanks to STAB combined with Technician. In tandem with Fake Out, Feint can take care of many sweepers like Abra, Zigzagoon, and Carvanha without opposition. Meowth also hits the coveted 19 Speed tier, allowing it to outpace almost the entire unboosted metagame, including threats like Mienfoo and Chinchou, and Speed tying with Ponyta. It's also an excellent anti-lead that is able to reliably take care of Onix and Dwebble. Unfortunately, Meowth is beaten by common priority attacks like Vacuum Wave and Mach Punch. It suffers from four-moveslot syndrome, as it's unable to carry all the coverage it needs, forcing it to be vulnerable to at least one of its checks. It's also incredibly frail and will usually get knocked out if it can't KO what's in front of it. Meowth is forced to run Life Orb, as it's fairly weak without one."
    },
    {
        "description": "Although Persian is faster than most of the unboosted metagame and has access to Nasty Plot and Technician, it is unfortunately a terrible Pokemon. None of its stats are particularly good outside of its Speed, which means it won't hit very hard, can't easily set up, and is easy to revenge kill with priority moves and Choice Scarf users. Persian is outclassed as a specially offensive Normal-type by Drampa, which hits much harder without even needing to set up and also has a secondary Dragon typing. Persian is also outclassed as a Nasty Plot sweeper by Alolan Raichu and Alolan Persian, with the former having a higher Special Attack stat and using its secondary Psychic typing to threaten Pokemon like Hitmonchan and Roselia, while the latter's access to Fur Coat provides it with actual defensive presence and makes setting up much easier."
    },
    {
        "description": "Too slow and sporting abysmal defenses, Psyduck has very little use in Little Cup. Base 55 Speed means that even with a Choice Scarf, Psyduck is not fast enough to outspeed threats such as Choice Scarf Snivy. Outclassed by Staryu in utility, Speed, and raw power and limited to two niche and near useless abilities in Cloud Nine and Swift Swim, Psyduck makes for an unviable Little Cup Pokemon."
    },
    {
        "description": "Despite a solid movepool and decent offensive stats, Golduck is simply outclassed by other Pokemon in the metagame as a rain sweeper such as Ludicolo, Floatzel, and Omastar. Nevertheless, it is otherwise effective in its role as a rain sweeper."
    },
    {
        "description": "Mankey is a revenge killer whose main niche over other Fighting-types is its access to Gunk Shot, which allows it to significantly damage Fairy-types, and Close Combat, which is one of the strongest Fighting-type moves. It also has other coverage moves such as Earthquake to hit Poison-types and Ice Punch to hit Foongus and Pumpkaboo, and a pivoting tool in U-turn, allowing Mankey to gain momentum, all of which are backed up by a great Attack stat and the respectable 17 Speed tier. Thanks to Defiant, it is also able to gain +2 Attack whenever it is affected by Sticky Web, Defog, or Intimidate. However, Mankey cannot take hits and is vulnerable to priority attacks due to its poor bulk, which is only amplified after Close Combat's defense drops. It faces heavy competition from other Fighting-types, primarily Mienfoo, as it is able to perform Mankey's role of a revenge killer far more consistently. In addition, Mankey's lack of Knock Off means that it has a tough time getting past Ghost-types, and while Defiant is a good ability, it is very situational and hard to make use of with Mankey's low bulk."
    },
    {
        "description": "Primeape can function as either a revenge killer with its Choice Scarf set or a fearsome wallbreaker with its other sets. Primeape, being one of the few Fighting-types with access to U-turn, is beneficial for providing momentum for its teammates and pivoting out on predicted switches. Primeape also has access to Defiant, which allows it to deter Defog very effectively. Primeape is also somewhat unpredictable, as it is able to run multiple sets, items, and coverage moves. Despite these attributes, Primeape has mediocre bulk and struggles to break past bulky Ghost-, Poison-, and Psychic-types without a moderate amount of team support. Furthermore, common balance Pokemon such as Jellicent make using STAB Close Combat a liability. Base 95 Speed is also a crowded Speed tier for non-Choice Scarf users, with Primeape finding trouble effectively revenge killing Jynx, Silvally-Ghost and -Fairy, and Haunter without forcing a Speed tie."
    },
    {
        "description": "Growlithe carves out a small niche as a defensive Fire-type due to its respectable bulk, ability Intimidate, and access to Will-O-Wisp letting it check most physical attackers. Unfortunately, Growlithe is largely outclassed by Ponyta and Larvesta due to their more useful movepools and access to Flame Body to passively spread burns. Growlithe also has issues as a check to physical attackers, as Morning Sun's low PP can leave it overwhelmed by very strong attackers, and Growlithe is unable to effectively check Pawniard due to Intimidate activating Defiant. In addition, Flare Blitz and Wild Charge recoil quickly chips away at Growlithe's HP, and its weakness to Stealth Rock necessitates entry hazard removal support for Growlithe to perform its role over the course of a game."
    },
    {
        "description": "Arcanine is one of RarelyUsed's prominent Fire-type Pokemon because it has the stats, movepool, and abilities to shine as a wallbreaker. Thanks to its good offenses and movepool, Arcanine can reliably 2HKO almost every defensive Pokemon in the metagame as well as threaten Stealth Rock setters such as Necrozma, Metagross, and Registeel. Flash Fire notably allows it to be one of the best counters to Ninetales in the tier. Arcanine also has a good Speed tier, outpacing offensive threats such as Roserade, Gardevoir, and Metagross. Despite those great traits, Arcanine's biggest flaw is that it is easily worn down by Stealth Rock, Flare Blitz recoil, and Life Orb, limiting the number of times it can safely switch in and compromising its potential as a check to Fire-types. Arcanine relies heavily on prediction, so one wrong prediction can leave it helpless against Pokemon such as Milotic, Mega Blastoise, and Golisopod. Fast threats such as Raikou and Zygarde-10% as well as common Choice Scarf users such as Tyrantrum, Drapion, and Flygon can outpace Arcanine. However, Extreme Speed does help against these threats if they are weakened. Arcanine faces competition as a Fire-type from Ninetales and Salazzle, which have better Speed tiers, boost their stats, and, in Ninetales's case, can reliably OHKO bulky Water-type Pokemon with Solar Beam. Arcanine also has competition as a Fire-type check with Houndoom, as Houndoom can also check Psychic-types and has a better matchup against bulkier teams."
    },
    {
        "description": "With its excellent Speed stat and access to Belly Drum, Poliwag can make a decent sweeper for offensive teams. Its access to Hypnosis can also help it set up and gives it a small niche over other Belly Drum users. However, better Belly Drum users such as Zigzagoon and, to an extent, Magby do a much better job at sweeping due to their access to good priority options. Poliwag is also held back by its relatively small movepool and paper-thin defenses, which keep it from finding reliable setup opportunities. It is incredibly vulnerable to being revenge killed by Choice Scarf and priority users as well. Finally, Poliwag needs a lot of support to even be worth using over other offensive Water-types and Belly Drum users."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Poliwrath is a strong option in the PU metagame thanks to its unique defensive typing and ability, which allow it to combat many of the tier's top threats including Alolan Sandslash, Lycanroc, Omastar, and Skuntank. Aside from extreme role compression, Poliwrath also has a diverse enough movepool to allow it to run a range of offensive and defensive sets as both a physical and special attacker while still managing to keep the aforementioned threats in check. Poliwrath is also one of the few Pokemon with access to moves and abilities such as Circle Throw, Vacuum Wave, and Water Absorb, which are extremely useful for phazing in conjunction with Spikes, revenge killing Omastar, and checking Water-types, respectively. However, Poliwrath's stats are incredibly average, meaning that it can't specialize or excel in any offensive or defensive roles outside of checking the same list of Pokemon. While Poliwrath's typing is extremely good for checking specific Rock- and Water-types, it also leaves Poliwrath vulnerable to a wide range of common Grass-, Flying-, Electric-, and Psychic-types, meaning that almost every team will naturally have multiple Poliwrath checks such as Oricorio-E or Eelektross. Lack of reliable recovery means that Poliwrath must use unreliable means such as Rest or a combination of Leftovers and Protect to avoid being worn down too quickly. Poliwrath also faces some competition from other Fighting- and Water-types such as Gurdurr and Lanturn, but while it will usually be outclassed in terms of raw bulk or strength, its niche is incredibly solid because nothing can compress roles quite like Poliwrath."
    },
    {
        "description": "Abra has exceptionally high Speed and Special Attack stats as well as a very useful ability in Magic Guard, which gives it the potential to function as either the tier's best revenge killer with a Focus Sash or a menacing wallbreaker with Life Orb. However, for as good as Abra's offensive capabilities are, it has less bulk than wet tissue paper, not to mention it is also vulnerable to all forms of trapping in the tier."
    },
    {
        "description": "Kadabra is an excellent revenge killer in the PU tier. In contrast to Musharna, which offers good defensive utility, Kadabra's main niche comes with its unique ability to check many offensive threats with Magic Guard and Counter. Kadabra's Focus Sash cannot be broken by residual damage due to its ability, which makes it very reliable at revenge killing. Its base 105 Speed tier is decent in PU, as it lets Kadabra outspeed Pokemon like Jynx, Simisear, and the Silvally formes, but it isn't amazing either, as Kadabra can also be outsped by important threats such as Alolan Persian and Lycanroc. Kadabra's main drawback comes from its terrible defensive stats, meaning it cannot switch into any type of attack; this makes Kadabra hard to fit on any archetype other than hyper offense."
    },
    {
        "description": "Alakazam is a notable threat in the OU metagame due to the valuable offensive niche it holds. Mega Alakazam is a fantastic special wallbreaker and sweeper, as its great Speed means it is outsped only by some Choice Scarf users. It also possesses the highest Special Attack stat in the tier as well as a useful ability in Trace, which lets it copy a plethora of useful abilities. It can copy Flash Fire and Levitate, letting it wall Heatran and Mega Latios lacking Draco Meteor, respectively. Regenerator can be copied from the likes of Toxapex, Tangrowth, and Tornadus-T to keep Mega Alakazam healthy. And even other situational abilities like Swift Swim, Beast Boost, and Soul-Heart can be occasionally copied. However, Mega Alakazam to some extent struggles to hurt some bulkier teams due to the presence of Magearna, Celesteela, and Ferrothorn. Regular Alakazam's niche lies in its access to Magic Guard, which allows it to run a Life Orb set that, just like Mega Alakazam, can switch into threats like Heatran reliably and force them out. Unfortunately, Alakazam is extremely frail and is thus extremely vulnerable to Choice Scarf users and priority, which are both quite common. They also are susceptible to common attacks in Pursuit, U-turn, and Knock Off."
    },
    {
        "description": "Machop is a decent Choice Scarf user with great utility moves in Knock Off and a 100% accurate Dynamic Punch thanks to No Guard. Dynamic Punch is very spammable due to the guaranteed confusion, as even Pokemon that resist it don't want to switch in and be confused. It's complemented further by great coverage moves, always giving Machop the option to hit what Dynamic Punch doesn't: Knock Off hits Ghost-types, Poison Jab hits Fairy-types, and Rock Slide hits Flying-types. However, Machop is very frail due to its lack of Eviolite and is very reliant on its Choice Scarf, becoming quite slow for its role without the Choice Scarf and losing almost all of its effectiveness. Machop's low bulk allows it to be easily revenge killed and its low base Speed causes it to be outsped by most other Choice Scarf users. Also, some checks to Machop such as Spritzee and Slowpoke don't mind the confusion very much, and the chance to hit oneself in confusion is only one in three. Machop faces competition from other Fighting-types: as a Choice Scarf user, Mienfoo gives it competition because of its better Speed, Regenerator ability, and access to U-turn, and as a bulky attacker, Timburr gives it competition because of its better bulk and access to Mach Punch."
    },
    {
        "description": "Machoke has cemented itself in ZU as an exceptional tank thanks to its notable Eviolite-boosted bulk and access to a great STAB attack in No Guard-boosted Dynamic Punch to threaten potential switch-ins and cause confusion. Its mixed bulk allows it to easily check Pokemon such as Electivire, Poliwrath, and a multitude of Silvally formes, while its pure Fighting typing is somewhat unique in ZU and allows it to check certain Pokemon such as Floatzel, Electivire, and multiple Silvally formes that threaten other Fighting-types in the tier such as Monferno, Combusken, Hakamo-o, and Poliwrath. A physically defensive set handles common threats such as Electivire, Pinsir, and Bouffalant. Alternatively, a specially defensive Machoke can be used to combat ZU's special attackers such as Combusken, Silvally-Dragon, and Poliwrath. Unfortunately, Machoke's reliance on Eviolite to accomplish its role as a tank limits how effective Machoke can be as a Dark-type check due to Knock Off being the most common Dark-type move in the tier. Common Psychic- and Flying-types in the tier such as Exeggutor, Beheeyem, Kadabra, and Swanna also heavily threaten Machoke. Machoke's lackluster Speed stat means that it can be taken advantage of when against common pivots such as Rotom-S, Mareanie, Zebstrika, and Choice Band Komala."
    },
    {
        "description": "Machamp's niche over other Fighting-types in the RU tier is its ability Guts, which can transform it into a powerful wallbreaker with Flame Orb, boasting over 590 Attack, while maintaining the flexibility to switch its moves and not worry about Toxic. Machamp's STAB move usefully threatens many of the tier's Stealth Rock setters, including Registeel, Rhyperior, and Gigalith, and the rest of its movepool allows it to either OHKO or 2HKO the remainder of the metagame. Even stall teams have little in the way of checks for Machamp, as Close Combat, Knock Off, and Facade can break through everything in conjunction with Machamp's Guts-boosted power and ability to switch moves. However, Machamp competes for a spot with Bewear and Pangoro, the tier's other premier Fighting-types, which both have access to Swords Dance along with better physical bulk in the former's case and a stronger Knock Off for the latter. In addition, without defensive investment, Machamp is fairly easy to revenge kill due to its poor Speed tier and lack of a STAB priority move, and it is worn down quickly thanks to residual damage stacking up from Flame Orb and pivoting into entry hazards."
    },
    {
        "description": "Bellsprout's Chlorophyll-boosted Speed along with Sleep Powder to work around its checks and Weather Ball to give it strong coverage make it extremely dangerous, and the new generation's addition of Poisonium Z and nerf to Gale Wings only made it stronger. However, Bellsprout's bulk is far from great, and it is almost useless outside of sun teams."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Victreebel is one of PU's top wallbreakers thanks to its excellent offensive prowess as well as its unique defensive properties. Strength Sap not only provides Victreebel with a form of reliable recovery but also allows it to beat Pokemon it otherwise wouldn't be able to beat in a one-on-one scenario, like Adamant Stoutland, physically offensive Skuntank, and Hitmonchan, by lowering their Attack stat. Additionally, a good defensive typing lets it easily switch into and check threats such as Gurdurr, Mudsdale, Regirock, and Lurantis, as well as absorb Toxic Spikes. Victreebel's nearly unresisted STAB coverage, good Attack and Special Attack stats, and access to high-Base Power moves like Leaf Storm and Power Whip allow it to threaten the majority of the metagame, including prevalent bulky Pokemon such as Mudsdale, Regirock, and Jellicent as well as top-tier threats like Gurdurr and Eelektross. Its ability to run both physically and specially offensive sets viably makes it unpredictable and very difficult to switch into, with counters to specially offensive Victreebel like Cryogonal and Drampa being unable to switch into physical moves like Power Whip and Poison Jab and Pokemon that can wall Swords Dance Victreebel like Alolan Sandslash and Metang being threatened by Hidden Power Fire. However, Victreebel struggles against Flying-types such as Oricorio-G, Articuno, and Altaria that can reliably switch in multiple times on the majority of Victreebel's sets and take it out easily. Moreover, Victreebel's mediocre bulk and middling Speed tier leave it easily revenge killed by a wide array of faster threats including Oricorio-E, Kangaskhan, Dodrio, Simisear, and Choice Scarf Aurorus."
    },
    {
        "description": "Tentacool's great Special Defense and decent Speed along with a good movepool allow it to be a decent entry hazard remover. It also has a good defensive typing, resisting common types like Fighting and Fairy. It doesn't have a slacking offensive movepool, either, with access to Sludge Bomb, Knock Off, and Scald. However, its actual attacking stats are lackluster, as is its physical bulk. Its longevity isn't helped by the fact that it doesn't have any reliable recovery outside Berry Juice, and it faces competition from other Water- / Poison-types like Skrelp and Mareanie. Nevertheless, Tentacool sets itself apart from these Pokemon by having access to Rapid Spin and a better Speed stat."
    },
    {
        "description": "Tentacruel's good Water / Poison defensive typing, which allows it to check threats such as Infernape and Scizor while absorbing Toxic Spikes, and access to Rapid Spin are what really set it apart from other Water-types in the tier. Additionally, good utility options in Toxic Spikes, Haze, and Knock Off give it the ability to support different playstyles and archetypes, and a good Speed tier also lets Tentacruel outspeed and heavily chip down threats to balance such as Mamoswine and Nidoking before going down without much investment. However, its subpar physical bulk and a lack of recovery outside of Z-Haze leave it hard pressed to check threats such as Scizor and Cobalion over the course of a game and reliant on teammates to serve as primary checks. Tentacruel’s weakness to a common offensive typing in Ground, which most Stealth Rock setters have, makes it more risky to remove entry hazards, even if they are forced out by Tentacruel’s Scald. Tentacruel also faces competition from Starmie as a spinner due to the fact Starmie has a much higher offensive presence and can switch into common Stealth Rock users such as Hippowdon and Swampert reliably. Tentacruel’s low damage output leaves it open to becoming setup fodder for bulky users, such as Reuniclus and Latias, even though Haze will deny their boosts if need be."
    },
    {
        "description": "Geodude is a decent Stealth Rock user, as its Sturdy ability in conjunction with a Berry Juice usually guarantees that it will set up Stealth Rock. However, it is largely outclassed by Onix in this role, as its superior Speed stat, unpredictability in ability options, and access to more utility moves like Taunt and Roar make it function much better as an entry hazard lead. Geodude does boast a far greater Attack stat and a nice movepool, though, containing Sucker Punch as a priority option, a very powerful Explosion, Counter to smack physical attacking foes back, and great STAB moves to take advantage of Geodude's amazing offensive typing, all of which give it a good offensive presence and make it function as a better suicide lead for offense teams. Like Onix, Geodude suffers with a bad Special Defense stat and mediocre HP stat, which coupled by its terrible defensive typing that gives it a 4x weakness to Water and Grass as well as other weaknesses to common types like Fighting and Ground, makes it mediocre defensively, though Sturdy does mitigate this hindrance."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Although Golem does face heavy competition as a lead, it does boast rather impressive offensive presence as a result of its high Attack and unresisted STAB combination, which allow it to exert more offensive pressure than competing Ground-type setters in Torterra and Mudsdale. Unlike most suicide leads, Golem isn't reliant on Focus Sash to do its job because of its ability Sturdy, meaning that it can hold other items like Weakness Policy or a Custap Berry and augment its offensive presence even further. Additionally, Golem's access to Explosion gives it a powerful means of pressuring removers not to clear the field and immediately generating momentum for its team, while its access to Sucker Punch gives it the ability to threaten more offensive teams as well as compensate for its low Speed. However, Golem tends to be less consistent than other suicide leads such as Lycanroc, Aurorus, and Omastar due to their access to solid support and utility options in Spikes, Spore, Encore, and Knock Off and their higher Speed. Golem also faces competition from Stealth Rock Aggron despite it not being a dedicated lead, as it boasts higher Speed, slightly greater offensive presence because of Head Smash, and access to Taunt. In addition, Golem is very predictable due to a lack of viable options outside of its main set, and has a hard time forcing out Defog users like Swanna and Cryogonal after Sturdy has been broken."
    },
    {
        "description": "Ponyta is an extremely potent and versatile threat in the LC metagame thanks to its blazing Speed tier, impressive defensive stats, and workable offenses. Its decent number of viable sets, ranging from utility to offensively oriented, allows it to edge out its competition in the tier's other Fire-types and always leave its opponent guessing, while its fantastic ability in Flame Body allows Ponyta to spread burns and check most physical attackers. Unfortunately, Ponyta's Stealth Rock weakness and vulnerability to Diglett serve as detriments to it given the prevalence of these factors. Furthermore, Ponyta is usually unable to outlast its counters due to the fairly low PP of its only reliable recovery option in Morning Sun."
    },
    {
        "description": "Rapidash is a poor Fire-type for a team. It is a utility attacker with decent coverage and Will-O-Wisp. Sadly, Rapidash is outclassed by other Fire-types like Simisear and Combusken, which have access to setup moves, and Combusken has a secondary STAB and Speed Boost. It also has a weakness to entry hazards such as Stealth Rock and Spikes and suffers recoil from its moves. While it has a great Speed tier, it has a subpar Attack and a movepool that hurts more than it helps."
    },
    {
        "description": "One of the most common tanks in the metagame, Slowpoke has great Defense and HP stats that allow it to tank most physical moves in conjunction with a reliable recovery option in Slack Off and a great defensive ability in Regenerator. Alongside its defensive stats, Slowpoke also has access to a great defensive moveset with utility moves such as Thunder Wave and good attacking options such as Scald, and moderate Attack and Special Attack stats that allow it to hit decently hard. Slowpoke's defensive typing is also beneficial, giving it resistances to many common attacks. Slowpoke's great physical Defense makes it a consistent and solid check to Mudbray, as it can easily take Mudbray's moves and KO it with Scald. Slowpoke is also welcome on most defensive cores due to its ability to freely switch out when it pleases due to the healing provided by Regenerator. Unfortunately, Slowpoke is rather passive and is often used as setup bait for Pokemon it can't touch, such as Scraggy, and it also serves as a free switch in for Pokemon such as Snivy. The common move Knock Off is a big threat to Slowpoke due to its high dependency on its Eviolite. Common pivoting moves like Volt Switch and U-turn are also threatening towards Slowpoke because they both deal super effective damage and provide momentum for the opposing team, which can be detrimental late-game."
    },
    {
        "description": "Slowbro's excellent defensive typing and great defensive stats allow it to act as a physical blanket check to key offensive Pokemon in the tier like Metagross and Tyrantrum. Its resistance to Fighting-type moves is particularly noteworthy, letting it switch into various threats such as Passimian, Toxicroak, and Bewear with ease. This is achieved thanks to Slowbro's exceptional longevity; its combination of Regenerator and Slack Off ensures it will be able to pivot into physical attackers throughout the whole match. Unfortunately, Slowbro faces competition from the other Water- and Psychic-types in the tier, such as Milotic, Mantine, and Necrozma, although unlike the former two, it is able to avoid passivity issues due to its decent Special Attack combined with a good offensive movepool. Although its typing blesses it with important resistances, it is also cursed with multiple weaknesses to common offensive typings like Grass, Dark, and Electric, which makes Slowbro vulnerable to powerful threats like Shaymin, Mega Blastoise, and Raikou. Additionally, it can get chipped for big damage or removed from the game entirely by trappers such as Drapion and Escavalier. Slowbro is also unable to dent most Water-types like Milotic and Mega Blastoise unless running the niche Grass Knot or Toxic. Finally, its mediocre Special Defense stat leaves it unable to wall specially offensive threats such as Noivern and Nidoqueen."
    },
    {
        "description": "Magnemite is a solid Pokemon in the LC metagame, able to act as a pivot or as a powerful attacker. Its viability stems from its fantastic Special Attack, allowing it to fire off powerful attacks without requiring a boosting item. It is further set apart from other special attackers by its fantastic typing that gives it a plethora of resistances, access to Volt Switch that allows it to serve as a pivot, and access to Sturdy + Berry Juice, allowing it to recover health consistently. However, Magnemite is hindered in the LC metagame by weaknesses to the common Fighting- and Ground-type moves. Additionally, Magnemite only hits 15 Speed, leaving it reliant on a Choice Scarf if it wants to outspeed the metagame or an intact Berry Juice to take hits against offensive teams."
    },
    {
        "description": "Magneton's niche lies in its access to Magnet Pull, which allows it to trap and revenge kill the omnipresent Scizor. It can also reliably trap and remove key Steel-types in Klefki and Empoleon, which can open the door for teammates like Latias, Mega Altaria, and Nihilego to more easily sweep. Outside of trapping Steel-types, Magneton has decent offensive presence thanks to its high Special Attack, decent dual STAB coverage, and access to STAB Volt Switch. It can also utilize its decent defensive typing to pivot in on passive attackers like Florges and Togekiss if need be. Unfortunately, Magneton's niche is often offset by its pitiful bulk, which mostly prevents it from taking advantage of its useful resistances or reliably coming into play. This can complicate its ability to trap Scizor due to its fear of directly switching in, often requiring that it accomplish its role with support from a pivoting teammate or through aggressive double switching. This also hampers its ability to check many Pokemon most other Steel-types can handle, such as Latias and Nihilego. Magneton's poor defensive capabilities are further compounded by its weaknesses to common Ground-, Fighting-, and Fire-type moves, which are often run as coverage by several Pokemon it could otherwise pressure, like Mega Aggron, Mega Altaria, and Togekiss. Its Speed is also extremely poor for an offensive Pokemon, leaving it outsped by the vast majority of the offensive metagame without a Choice Scarf and by Pokemon like Mega Aerodactyl and Zeraora even with a Choice Scarf. These flaws often prevent Magneton from being able to reliably provide for its team outside of its role as a trapper, meaning it faces severe competition from other Electric-types with stronger defining characteristics and niches, like Rotom-H and Mega Manectric, and should usually never be run unless trapping Steel-types is desired, making it a very niche Pokemon."
    },
    {
        "description": "Farfetch'd is unsurprisingly an awful choice because its stats are pitiful and it's hopelessly outclassed by many other Flying-types in the tier. While it has some eye-catching quirks like First Impression, it often flops compared to other options for wallbreakers or priority users due to its unspectacular Speed tier and nearly complete lack of defensive utility making it easy to revenge kill. Dodrio and Scyther in particular sport Swords Dance as well and have much better Speed tiers. Farfetch'd also struggles to put a dent in Steel-types and Oricorio-E, despite its decent movepool otherwise."
    },
    {
        "description": "Doduo's excellent Attack stat, powerful STAB moves, and good coverage options make it one of the best physical attackers in the LC metagame. It typically takes on the role of a powerful wallbreaker, using its very good Speed stat and coverage options to wear down opposing teams or to end games against slower teams. It is helped in its wallbreaking by its coverage options, which make it impossible to safely switch into. Doduo can also flip its wallbreaking set on its head and run a Choice Scarf set, which outspeeds most of the Pokemon that typically revenge kill it and can reliably clean up weakened teams late-game. However, Doduo suffers from poor defensive stats that leave it vulnerable to revenge killing and priority attacks. Furthermore, its most powerful and spammable move, Brave Bird, has significant recoil damage, which, coupled with its Stealth Rock weakness, means it tends to get worn down very fast."
    },
    {
        "description": "Dodrio's fantastic offensive stats, near-unresisted coverage, and access to Swords Dance solidify it as a top offensive threat in PU that's able to blitz through Pokemon found on offensive and defensive teams alike. It can run a variety of sets that each offer immense amounts of offensive pressure: Swords Dance and Choice Band sets excel at wallbreaking, whereas Choice Scarf sets boast a near-unrivaled Speed tier. Since all of Dodrio's sets fit on offensive teams, deciphering what set it's running from Team Preview is nearly impossible, giving Dodrio the upper hand in many situations. However, Dodrio's lackluster bulk and weakness to Stealth Rock limit what it can safely switch into or use Swords Dance on, and it is easily worn down by Brave Bird's high recoil. Dodrio's matchups are also highly set dependent, as wallbreaking sets are prone to being revenge killed, while Choice Scarf lacks the power to break through bulky walls like Regirock and Mudsdale."
    },
    {
        "description": "Above-average defenses and access to some interesting support moves in Whirlpool and Perish Song allow Seel to carve out a niche role as the bulkiest Perish trapper, theoretically allowing it to take on a huge number of Pokemon in LC. The downsides are the strategy is one-dimensional and can be easy to play around once revealed, costing the user momentum. Other supporting Water-types such as Mareanie and Frillish are generally better choices, since they can compress multiple roles and fit better in the current metagame."
    },
    {
        "description": "Dewgong is completely outclassed as a bulky Water-type by Pokemon like Lanturn and Jellicent due to their better typing and lack of Stealth Rock weakness. Jellicent also has reliable recovery, and both have more valuable utility options such as Volt Absorb and Heal Bell for Lanturn, as well as Taunt and Will-O-Wisp for Jellicent. Dewgong's awful defensive typing also makes it extremely passive, so it can't even utilize its niche to the fullest extent; While it can be used on stall as a Perish trapper, Pyukumuku has a more valuable role on stall as a trapper with Block that can wear down opposing Pokemon with Toxic, punish setup sweepers with Unaware, and use reliable recovery in Recover."
    },
    {
        "description": "Even though Grimer's Poison typing and Sticky Hold ability let it switch in on Fighting-types, as it resists their STAB attacks and does not risk losing its item, Trubbish does the same thing but better because of its higher Speed, access to entry hazards in Spikes, and repeated Berry Juice recovery with Recycle. Other bulky Poison-types like Foongus and Mareanie use their secondary typings to not completely fall flat to Diglett and to pivot effectively with Regenerator, respectively. Lastly, Alolan Grimer completely overshadows Grimer as a bulky Poison-type because of its Poison / Dark typing, granting only one weakness and having exclusive access to moves like Knock Off and Pursuit to effectively trap Abra and Gastly."
    },
    {
        "description": "Muk carves a niche in the metagame as a capable bulky setup sweeper thanks to its access to Curse, managing to separate itself from other bulky setup sweepers like Spiritomb and Type: Null because of its inability to be crippled by Trick, Switcheroo, and Knock Off, courtesy of its ability Sticky Hold. Muk can also serve as a decent check to certain threatening special attackers such as Oricorio-E and Floatzel due to its high special bulk, with its typing also allowing it to absorb Toxic Spikes. Because of its high Attack, powerful STAB Gunk Shot, access to Shadow Sneak to slightly mitigate its low Speed, and expansive coverage in moves such as Fire Punch, Ice Punch, and Explosion allowing it to threaten Pokemon like Mawile, Claydol, and Qwilfish, Muk is also capable of pulling off a Choice Band set, standing apart from Skuntank due to its higher Attack and Special Defense as well as its ability to more reliably switch into bulkier Pokemon such as Ferroseed and Clefairy. However, Muk still faces a decent amount of competition as both a setup sweeper and an offensive Poison-type. Curse Muk requires a lot more support to work than other bulky setup sweepers like Spiritomb, Type: Null, and Lurantis, while Skuntank tends to outperform Choice Band Muk due to its higher Speed, secondary Dark typing that allows it to threaten Ghost- and Psychic-types, and greater utility. Muk's typing isn't very good offensively, and it struggles to break through certain Steel-, Ground-, and Ghost-types like Aggron, Mudsdale, and Spiritomb because of this. Choice Band Muk is also relatively easy to exploit because of how common bulkier Pokemon like Qwilfish are. Despite Shadow Sneak slightly mitigating Muk's low Speed, it will still often have to take a hit before dishing one out in response. Finally, Muk is vulnerable to strong physical attackers like Zangoose because of its low Defense."
    },
    {
        "description": "Possessing immense physical bulk and passable Speed and Attack, Shellder has the right traits to pull off a successful Shell Smash set. Being a pure Water-type is also beneficial for Shellder, not only giving it a great number of setup opportunities but also making it neutral or resistant to all priority attacks. Additionally, Skill Link gives Shellder an edge over most other Shell Smash users, as it allows Shellder to circumvent Focus Sash Abra without giving up an important coverage move. Skill Link has some interesting quirks in LC, making Icicle Spear and Rock Blast hit far harder than their already impressive 125 Base Power would imply. However, Shellder heavily relies on Shell Smash to become a threat and can hardly afford not to run the move."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Gastly is a fantastic Pokemon in the LC metagame thanks to its very good Speed stat, which allows it to offensively check tier titans such as fast Mienfoo and Snivy, and its top-tier Special Attack stat, which allows it to put enormous pressure on teams and reliably break down opposing walls. Its movepool leaves it with a plethora of coverage options that make it extremely difficult to switch into, and even includes reliable support moves such as Will-O-Wisp and Destiny Bond. Gastly's Ghost typing also comes with significant advantages, giving it an immunity to Fighting-type priority moves and allowing it to act as a risky spinblocker for hyper offensive teams. However, Gastly's poor defensive stats and weakness to the common Dark-type leave it prone to being taken out by anything it doesn't KO."
    },
    {
        "description": "Haunter is an overall decent offensive threat, being able to serve as a wallbreaker with its Life Orb set or as a revenge killer with its Choice Scarf set. This is mostly thanks to its good base 95 Speed tier, which allows it to outspeed Pokemon such as Oricorio-E and Rotom-F and Speed tie with Pokemon such as Jynx and Primeape, and its threatening Special Attack. Furthermore, Haunter’s good Ghost / Poison typing allows it to hit almost the entire metagame neutrally with STAB attacks and combines with Levitate to give Haunter three useful immunities in Ground, Normal, and Fighting. Haunter also has a vast utility movepool that includes moves such as Destiny Bond, Trick, Will-O-Wisp, and Substitute, which allows it to better handle its checks and support its teammates. Despite this, Dark-types are always a large problem for Haunter, as Skuntank resists both of its STAB moves while Spiritomb can bypass Substitute, and both can Pursuit trap Haunter or threaten it with Sucker Punch, although they do fear certain utility or coverage moves. Haunter's abysmal defenses leave it unable to switch into even most resisted hits, and it can be easily revenge killed by faster threats and priority users assuming it does not have a Substitute up. This also makes it tricky to use as a spinblocker, as it fears moves such as Hitmonchan's Thunder Punch. Finally, Haunter faces competition from Oricorio-G, which boasts access to Calm Mind, better bulk, reliable recovery in Roost, and Dancer to give it an even better matchup against Bellossom."
    },
    {
        "description": "Great Special Attack, a high Speed tier, and most importantly, a near-exclusive ability in Shadow Tag leave Mega Gengar as one of the most dreaded threats in the tier that can selectively eliminate foes it desires to trap."
    },
    {
        "description": "Onix is arguably the best Stealth Rock user in Little Cup, and for very good reason. Its ability Sturdy essentially guarantees that it sets up Stealth Rock and helps give it multiple chances to do so. It also has the highest Defense stat in the tier by far, although it struggles to utilize it due to its abysmal defensive typing that gives it many weaknesses and a vulnerability to entry hazards, which can cripple it extremely."
    },
    {
        "description": "Insomnia is Drowzee's most attractive feature, when you add that into its average defensive stats, gives it a nice role as a Foongus and Abra counter. Having semi-reliable recovery in Wish lets Drowzee stick around longer to perform its duties multiple times and check some other threats as well. However, Drowzee doesn't hit particularly hard which invites offensive threats such as Snivy to set up on it, and its Psychic typing is relatively easy to counter."
    },
    {
        "description": "Despite its above-average Special Defense and access to Wish, fierce competition from Audino relegates Hypno to taking on a more offensive role. With its decent special bulk, Hypno can utilize Hypnosis to gain free turns and set up Belly Drum safely. However, banking on Hypno to land Z-Hypnosis in the first place combined with the fact Hypno is still outsped at +1 by nearly every relevant Choice Scarf user makes it a bad setup sweeper to waste giving the Z-Crystal to. Hypno also is unable to break through certain Pokemon such as Musharna, Spiritomb, and Sableye."
    },
    {
        "description": "Krabby seems appealing due to its high Attack stat, usable Speed, and good ability in Sheer Force, allowing it to be a strong cleaner. However, it faces stiff competition from other physical Water-types in the tier such as Corphish and Totodile, as they have better movepools including ways to boost both Speed and Attack in Dragon Dance and a priority option in Aqua Jet, both of which Krabby lacks. These Pokemon also have better bulk, giving them an easier time setting up than Krabby, whose poor Special Defense grants it limited setup opportunities. This forces it to opt for a Choice Scarf revenge killer set to differentiate itself, which does not have a serious niche due to the limited value of Water as its sole STAB attacking type."
    },
    {
        "description": "While Kingler boasts an impressive Attack stat complemented by a decent movepool, Sheer Force, and Agility, which gives it a decent matchup against offensive teams, it sadly struggles to break through walls like Vaporeon and Seismitoad. Moreover, its bad special bulk makes it extremely hard for it to set up and leaves it easily revenge killed by faster threats such as Sceptile and Magmortar and by priority move users like Comfey after setup. It also suffers from competition from other Water-types wallbreakers such Samurott, which has higher bulk, Aqua Jet, and Megahorn and can afford to use a Z-Move, giving it a stronger Bug-type move in Savage Spin-Out."
    },
    {
        "description": "Despite being one of only three Little Cup Pokemon to be able to reach the coveted 20 Speed benchmark, Voltorb’s stats bar its Speed, as well as its movepool, leave it no choice but to take on a utility role of setting Light Screen and Reflect. Because Voltorb has to hold an item other than Eviolite to most effectively set dual screens, its bulk is lacking, allowing it to be severely chipped away at by priority users such as Pawniard and Timburr and common Choice Scarf users such as such as Mienfoo and Magnemite and OHKOed by a majority of strong neutral STAB attacks. Light Screen and Reflect are also not particularly noteworthy as a team strategy, as Memento users such as Cottonee and Aurora Veil users such as Alolan Vulpix perform this role more consistently, leaving Voltorb virtually outclassed in every role it can perform."
    },
    {
        "description": "Thanks to a phenomenal Speed stat and access to both Reflect and Light Screen, Electrode is able to set itself apart from PU's other Electric-types as the best dual screens user in the tier, functioning as a potent lead for hyper offense teams. Electrode also is the fastest user of Taunt in PU and can deny opposing Taunt from the likes of Jellicent and Lycanroc, prevent the use of Defog to clear Reflect and Light Screen from the field, and obstruct setup from sweepers such as Oricorio-E and Bellossom to compensate for its lack of offensive presence. Electrode's access to Explosion and Volt Switch allows it to instantly generate momentum for its team and maximizes the number of turns Electrode's teammates can utilize before screens wear off, though Explosion will sacrifice Electrode in the process. Unfortunately, Electrode is only viable on screens-based hyper offense teams and is outclassed offensively by other Electric-types such as Oricorio-E and Alolan Raichu due to their greater offensive stats, more expansive movepools, secondary typing, and access to setup moves in the form of Calm Mind and Nasty Plot, respectively. Screens-based hyper offense teams are heavily reliant on offensive pressure to function and, as a result, are inconsistent against teams that have enough defensive checks to common breakers and setup sweepers. Electrode is also vulnerable to Prankster users such as Liepard and Sableye, as they can use Taunt on Electrode before it can get up Reflect and Light Screen. Choice Scarf Primeape is also able to outspeed Electrode and restrict it to only setting up one screen by threatening it with Close Combat, while Ground-type Stealth Rock setters such as Mudsdale and Golurk can punish Electrode with Earthquake if it opts to use Taunt."
    },
    {
        "description": "Exeggcute has some potential as a support Pokemon in the LC metagame thanks to its great physical bulk and decent support movepool, which contains options such as Sleep Powder and Stun Spore. Its ability Harvest gives Exeggcute access to passive recovery when paired with an Oran Berry as long as Exeggcute is not hit by Knock Off. However, Exeggcute's typing, while not awful, leaves it vulnerable to a plethora of LC's most common attacking moves, such as U-turn, Knock Off, and Flying-type attacks. Due to its typing, Exeggcute will usually fail to check the physical attackers it aims to check because they carry a super effective coverage move. Exeggcute is further held back by poor Speed and Special Defense, which couple to make it easily taken out by special attackers. Finally, Exeggcute often relies on putting Pokemon to sleep to set up Substitute, which leaves it extremely reliant on Sleep Powder's relatively low accuracy. Due to these flaws, it is usually difficult to justify using Exeggcute over Foongus, which has a better typing, comparable bulk, and a more accurate sleep-inducing move. Exeggcute's niche lies in its good Defense stat, a resistance to common Ground-type attacks, and passive recovery."
    },
    {
        "description": "Exeggutor's high Special Attack combined with its decent movepool makes it a decent wallbreaker or sweeper, which is further enhanced by its access to Sleep Powder to cripple switch-ins such as Skuntank and Audino. Due to the Trick Room and Choice Specs sets having different counterplay, it can be somewhat hard to deal with, as the former has a good matchup against offensive teams while the latter has a nice matchup against balance builds. This is bolstered by Exeggutor's typing and decent bulk, which allow it to switch into Water-, Grass-, Ground-, Electric-, and Fighting-type attacks from the likes of Poliwrath, Bellossom, Mudsdale, Alolan Raichu, and Hitmonchan, as well as its ability to pressure walls it comes into, such as Gastrodon and Regirock. However, Exeggutor suffers from mediocre speed, leaving it extremely susceptible to faster threats like Skuntank, Aurorus, Dodrio, and Scyther, although this can be remedied with Trick Room. Its STAB moves can be hard to use effectively due to Pokemon like Alolan Sandslash being so common, leaving it extremely reliant on making the right prediction, and even if it does, being locked into a move can be extremely costly. While its typing gives it some opportunities to come in, it also brings weaknesses to common Pokemon such as Simisear and particularly to Pursuit trappers like Skuntank. U-turn from the likes of Primeape is also extremely annoying. Lastly, Exeggutor suffers from competition as an offensive Grass-types from Victreebel, which has a better typing both defensively and offensively, making it way easier for it to simply spam its STAB attacks and giving it more opportunities to come in."
    },
    {
        "description": "Cubone is one of the hardest hitters in Little Cup thanks to its Thick Club-doubled Attack. It also has a unique and powerful STAB attack in Bonemerang, which hits twice and thus can break Focus Sash and Sturdy. Combine that with its great physical bulk and good coverage options in Knock Off and Rock Slide, and you've got one powerful wallbreaker. Unfortunately, Cubone is really easy to take advantage of due to its poor Speed and special bulk, therefore requiring a lot of support from teammates to effectively sweep. It also faces competition from Mudbray, which isn't as strong as Cubone but is faster and bulkier. Lastly, Cubone is extremely vulnerable to Knock Off due to its reliance on Thick Club to deal any sufficient damage."
    },
    {
        "description": "With its Thick Club in hand, Marowak can act as a suboptimal Trick Room attacker. Marowak's near-perfect coverage between Earthquake and Stone Edge may sound enticing at first, but several other physical Trick Room attackers such as Crabominable and Ursaring have near-perfect coverage as well. Marowak also must hold a Thick Club in order to double its Attack, which makes it susceptible to Knock Off users that can check it defensively such as Tangela and Gurdurr."
    },
    {
        "description": "Hitmonlee is an interesting, albeit very flawed, setup sweeper in NeverUsed. Its appeal comes from access to both Curse and the ability Unburden, which, after consuming a White Herb, makes Hitmonlee the fastest non-Choice Scarf Pokemon in the tier. However, despite a naturally high Attack stat, Hitmonlee has trouble breaking through typical Fighting-type answers such as Garbodor, Palossand, and especially Weezing. Furthermore, Hitmonlee only gets one chance to sweep, and if it loses its White Herb before it sets up, it is potentially dead weight, limiting it to being a late-game sweeper. If it doesn't set up, Hitmonlee's middling Speed and poor bulk mean it is easily revenge killed by faster Pokemon such as Whimsicott, Choice Scarf Passimian, and Delphox. This is why Hitmonlee finds itself outclassed as a Fighting-type by Passimian and Medicham."
    },
    {
        "description": "Hitmonchan is a solid Pokemon in PU thanks to its amazing role compression. It's an offensive spinner that threatens many of the tier's Stealth Rock setters such as Regirock, Alolan Sandslash, and Aggron while being bulky enough to act as a blanket check to some of the best specially offensive Pokemon such as Aurorus, and it can act as a revenge killer thanks to Mach Punch. While it lacks a method of reliable recovery, it can mitigate this with Drain Punch or a pinch Berry. However, Hitmonchan's limited movepool leaves it unable to deal with Pokemon that can threaten it out of the battle such as Clefairy and Tangela, and it is worn down quickly by entry hazards and status conditions. Unless it runs Toxic or an appropriate coverage move, Hitmonchan is helpless against Ghost-types such as Jellicent and Sableye and other hazard setters such as Roselia and Qwilfish, which can make it an unreliable spinner at times. Hitmonchan is also vulnerable to being revenge killed by physically offensive threats such as Gurdurr, Kangaskhan, and Dodrio because of its low Defense. Gurdurr, in particular, can set up in front of it and take advantage of Toxic by activating Guts."
    },
    {
        "description": "Lickitung can check many offensive threats in the metagame, such as Abra, Magnemite, Bellsprout, and Gastly, due to its great defensive stats. Furthermore, Lickitung's bulk combined with its access to Wish and Heal Bell make it a great support Pokemon on balanced and defensive teams. Lickitung can also use its support and status moves against Taunt users due to Oblivious. However, Lickitung's typing lacks resistances, meaning it has to rely on its raw bulk and Eviolite when switching into powerful attacks. Furthermore, Lickitung's low Speed combined with its passivity makes it struggle in such an offensive metagame and leaves it vulnerable to several offensive Pokemon in the tier. Lickitung also struggles against the common Fighting-types in the tier, such as Mienfoo and Timburr. Lastly, Lickitung faces competition from Spritzee as a Wish passer and cleric and from Munchlax as a Normal-type special wall."
    },
    {
        "description": "A Poison typing with the complementing ability Levitate leaves Koffing with useful resistances and only one weakness. Its great Defense stat allows it to be a nuisance to common Fighting-types such as Mienfoo and Timburr, and its wide movepool leaves it with plenty of coverage and support options such as Fire Blast and Will-O-Wisp. However, its shabby offensive stats give it an underwhelming offensive presence, which can allow Pokemon such as Guts Timburr, Pawniard, and Scraggy to set up on it. Additionally, its mediocre HP and bad Special Defense mean it often can't take special hits. It is also fairly reliant on its Eviolite being present to tank a lot of hits."
    },
    {
        "description": "Weezing differentiates itself from other defensive Poison-types such as Garbodor and Golbat due to its access to Levitate, which lets it check Ground-types such as Steelix and Rhydon without a weakness to Spikes. Additionally, Weezing's Poison typing allows it to check both Fighting- and Grass-type Pokemon such as Passimian, Decidueye, and Sceptile. Weezing's access to the combination of Will-O-Wisp and Taunt lets it be effective against more defensive teams. Unfortunately, Weezing faces competition for the spot of a bulky Poison-type from Pokemon like Garbodor and Golbat, which have better Special Defense stats, allowing them to better check specially offensive Grass-types such as Whimsicott and Sceptile, as well as having reliable recovery in Golbat's case."
    },
    {
        "description": "Despite its great HP, Attack, and Defense, Rhyhorn is outclassed by Rock-types such as Onix and Tirtouga, as they have better bulk and access to decent utility options, which Rhyhorn lacks. Rhyhorn's poor Special Defense and Speed in tandem with its common weaknesses mean that many special attackers are able to outspeed and easily KO it, which worsens Rhyhorn's defensive presence. The presence of Onix, a check to Flying-types with higher Speed and better abilities and Pawniard, a better offensive Stealth Rock setter that checks Flying-types, makes it hard to justify using Rhyhorn on any serious team."
    },
    {
        "description": "Rhydon excels as a Stealth Rock setter thanks to the combination of its solid Eviolite-complemented bulk and typing, as well as its great offensive presence, letting it pressure common forms of entry hazard prevention in Xatu, Dhelmise, Rotom, and Blastoise while serving as an effective stop to Pokemon like Incineroar and Braviary. Additionally, Rhydon's great Attack stat combined with Swords Dance and its passable Speed tier lets it function as a strong wallbreaker capable of dismantling walls like Vaporeon, Dhelmise, and Druddigon at +2. However, Rhydon's reliance on Eviolite for bulk makes it susceptible to Knock Off, and its resulting lack of recovery makes it easy to wear down. Additionally, Rhydon is vulnerable to the plethora of Water- and Grass-type Pokemon in the tier, as well as common coverage options such as Delphox's Grass Knot, Heliolisk's Surf, and Vivillon's Energy Ball, which harms its reliability as a standalone check to these Pokemon."
    },
    {
        "description": "Chansey's monstrous HP and high Special Defense stats make it the bulkiest special wall in the tier, boasting the ability to reliably handle the majority of the special attackers that the OU tier has to offer. To further accentuate its defensive prowess, Chansey has access to a plethora of viable utility moves such as Stealth Rock, Toxic, Thunder Wave, and Heal Bell, which makes it a must on almost all stall teams. On the flipside, while Chansey's measly Defense stat is covered for by its gargantuan HP stat combined with heavy EV investment, Chansey is still overwhelmed by physical attackers with setup moves such as Swords Dance Landorus-T and Kartana. Chansey's defensive typing is also interesting; while a Normal typing grants it only a single weakness, it also means Chansey has no resistances and only a single immunity. Furthermore, as is the case for many defensive Pokemon, Chansey is relatively slow and somewhat passive, relying heavily on Seismic Toss or status moves in order to inflict damage, meaning it can be relatively easily exploited by a number of offensive Pokemon. Lastly, Chansey is heavily reliant on Eviolite, as without it, Chansey is significantly less bulky and greatly struggles to check some of the more powerful offensive threats that it is usually tasked to handle."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "A strong ability in Parental Bond synergizes well with Seismic Toss to boost Mega Kangaskhan's damage to acceptable levels, as well as granting it decent utility through amplifying secondary effects."
    },
    {
        "description": "Horsea can be a threat under rain, but that is where the problem lies. Because manual weather is so bad and it has terrible bulk, Horsea finds itself unable to set up Rain Dance. When it does manage to use Rain Dance, it is forced onto a time limit because of the short duration of manual rain. Furthermore, Horsea is outclassed by other Swift Swim users such as Omanyte, as they can hit much harder than Horsea in the rain. Other offensive Water-types like Corphish outclass it as well because of having better bulk and raw power. Without rain being active, Horsea finds itself slower than a lot of the tier's most common offensive Pokemon."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Kingdra's decent Speed stat in combination with Swift Swim allows it to outspeed the entire unboosted metagame, as well as most Choice Scarf users, when in the rain. This combined with a decent Special Attack stat makes it a top Swift Swim user in the metagame. Kingdra's access to a powerful secondary STAB move in Draco Meteor is a blessing, giving it the means to pressure or KO Pokemon that annoy rain teams such as Mega Venusaur and Mega Latias. Kingdra's Dragon / Water typing is also useful for checking Ash-Greninja as it is a rain attacker that isn't prone to Water Shuriken. Unfortunately, bulky Water- and Grass-types such as Toxapex, Ferrothorn, and Assault Vest Tangrowth are some of the most common defensive Pokemon in OU, meaning that Kingdra will have trouble sweeping most teams. Kingdra is also heavily dependent on rain in order to be effective, as it is relatively weak and slow for an offensive Pokemon outside of it."
    },
    {
        "description": "Goldeen has a fantastic ability in Lightning Rod, allowing it to be a great check to Electric-types such as Chinchou and Magnemite; it can also directly threaten them with Drill Run, making it one of the best stops to Volt Switch in the metagame. Its Water typing provides it with useful resistances to Water-, Ice-, and Steel-type attacks, which are commonly run as coverage by LC's premier Volt Switch users. Goldeen's movepool has useful options such as Knock Off, Megahorn, and specifically Bounce, which can be used alongside a Flyinium Z to let Goldeen lure in and KO Grass- and Fighting-types. Goldeen's good Attack and Speed allow it to put some offensive pressure on the opposing team. However, Goldeen generally faces competition as a physically offensive Water-type from the likes of Corphish, which has extremely strong STAB attacks thanks to Adaptability and access to Dragon Dance and Swords Dance, and Carvanha, which hits harder, more consistently breaks through Grass-types, and has Speed Boost to outpace normally faster Pokemon. Goldeen's bad bulk also doesn't help its case, as it takes massive damage from powerful neutral hits and will almost always get OHKOed by super effective attacks. Finally, Goldeen lacks a good way to hit bulky Water- and Flying-types as well as Grass- and Fighting-types after Supersonic Skystrike has been used up, meaning that it can be walled fairly easily by Pokemon like Timburr and Foongus."
    },
    {
        "description": "Besides its average Attack stat, Seaking's stats are mediocre, making it very easy to outspeed and KO. Even with its unique ability for a Water-type in Lightning Rod, Seaking finds itself outclassed by Lanturn. Lanturn has higher overall bulk, a secondary typing, and access to Volt Switch. Furthermore, Seaking is also outclassed by other physical Water-types such as Floatzel, Kabutops, and Carracosta with their higher offensive presence, ability to set up, overall versatility, the first two's higher Speed, the last two's secondary typing, and Carracosta's better bulk."
    },
    {
        "description": "Staryu is one of the best entry hazard removers in Little Cup thanks to its great Speed, good typing, and cool coverage. Though it competes with Defog users such as Vullaby, being able to maintain allied entry hazards when using Rapid Spin is an important advantage. Additionally, the combination of Hydro Pump and Analytic makes Staryu's offensive sets even more potent. All of these factors combine to make Staryu a great partner for hazard-fearing Pokemon such as Ponyta and Doduo and an overall excellent glue Pokemon."
    },
    {
        "description": "Starmie is an excellent offensive Pokemon thanks to its great coverage options and useful ability Analytic, and it is also the fastest Rapid Spin user in the tier. In addition to having great offensive capabilities, it also has adequate tools such as Natural Cure, Recover, and Reflect Type that let it viably run a bulkier set geared more towards support. Starmie's Speed tier is fantastic, letting it outspeed many offensive threats like Latias, Terrakion, and Infernape. However, Starmie's raw power without boosts is lacking due to its middling base 100 Special Attack, which can cause it some trouble in breaking past bulkier Pokemon such as Sylveon and Snorlax. This is much more apparent when using bulky variants of Starmie with no Special Attack investment, making these variants unfortunately rather passive versus targets that do not care about burns. While its Water / Psychic typing gives it some useful resistances that allow it to act as a soft check to Pokemon such as Infernape and Cobalion, Starmie is moderately frail, which means that without investment it will not be able to switch in on even many resisted hits. Its typing also gives it a very serious weakness to Electric-, Bug-, Dark-, Ghost-, and Grass-type attacks, which leaves it extremely vulnerable to strategies such as Pursuit trapping and VoltTurn."
    },
    {
        "description": "Mr. Mime possesses no notable niche over other Psychic-types like Musharna and Jynx despite its secondary Fairy typing. Its Nasty Plot set can work against balance and stall teams by breaking through walls and hitting surprisingly hard with its perfect neutral coverage, and its Fairy typing helps it serve as a reliable check to Dragon-types in the tier like Drampa and Altaria. However, although Mr. Mime's Speed is slightly above average, it is slow enough to be scared out by faster Pokemon due to its poor physical bulk and HP. Its defenses also leave it susceptible to priority moves and Pursuit trapping, which can make it hard to use. While its Fairy typing can lend a hand in checking Fighting-types more easily, Mr. Mime still faces a lot of competition from fellow Psychic-types Jynx and Musharna, which are simply much better all around due to better secondary STAB and access to Lovely Kiss for the former and far superior bulk for the latter."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Jynx stands out as a dangerous and effective sweeper and wallbreaker thanks to its access to the incredible Z-Lovely Kiss as well as Nasty Plot, which allows it to boost its Speed and Special Attack while putting foes to sleep. Its excellent dual STAB combination allows Jynx to forgo coverage if it needs to, although Focus Blast is a great option for getting neutral coverage on the entire tier. Jynx also has decent set diversity, with its Choice Scarf and Substitute sets being able to catch foes off guard. Dry Skin gives Jynx even more utility, allowing it to check a plethora of Water-types in the tier including Poliwrath and Floatzel. However, Jynx has awful defenses and a terrible defensive typing, leaving it susceptible to most forms of priority and all entry hazards. While its Speed tier is decent, it still leaves Jynx open to being revenge killed by a number of threats, including a few notable Choice Scarf users such as Dodrio even when Jynx is at +1. Finally, Jynx can have difficulty with Lovely Kiss's accuracy and the prevalence of other base 95 Speed Pokemon, which can lead to very common Speed ties with foes such as Primeape."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "No movesets available. "
    },
    {
        "description": "Thanks to its naturally high Attack, access to Swords Dance, and great ability in Aerilate, Mega Pinsir can act as a dangerous wallbreaker in the metagame. Aerilate-boosted priority in Quick Attack lets Mega Pinsir function as a pretty effective revenge killer that is able to pick off threats like Volcarona and weakened Serperior. Also, Mega Pinsir's Speed tier gives it an edge over other, slower wallbreakers like Mega Medicham, Mega Mawile, and Mega Heracross. Unfortunately, Mega Pinsir's defensive typing is terrible, giving it a 4x weakness to Stealth Rock. The omnipresence of Zapdos, Rotom-W, Tapu Koko, and Celesteela makes Mega Pinsir further struggle in the metagame not only because they take advantage of Mega Pinsir's typing but also because Mega Pinsir can't run all the coverage moves necessary to hit them super effectively. Additionally, while Mega Pinsir's Speed tier isn't bad, it leaves Mega Pinsir outpaced by common threats like Tornadus-T and Greninja. Because of these factors, Mega Pinsir requires a lot of support to function properly and is heavily outclassed by other wallbreakers like Mega Mawile, Garchomp, and Mega Medicham."
    },
    {
        "description": "Although Tauros's Speed tier and coverage options let it threaten Pokemon like Heliolisk, Steelix, and Garbodor, its inability to reliably break common defensive Pokemon like Regirock, Rhydon, and Palossand leaves it outclassed by wallbreakers like Heliolisk, Sceptile, and Magmortar that can bypass their checks with their coverage moves and sheer power. Tauros is further hampered by its lacking defensive traits, which make it difficult to switch in and set up safely against almost anything other than Xatu, while other wallbreakers like Incineroar and Alolan Exeggutor find multiple chances to come into battle thanks to their typing and abilities."
    },
    {
        "description": "The year is 2019. The Pokemon world, too, is suffering from the ravages of climate change. Decades of industrialization, oil spills, and poor environmental management have turned the seven seas into cesspools of toxicity. Oceanic food chains are collapsing as temperatures rise, boiling the sea. The ocean can no longer bear the legacy of human callousness. Yet still, something emerges out of the poisoned waters. A young boy casts his Old Rod, confident that he will succeed in his daily catch. A grizzled old man travels the waters in a rowboat, searching for a white Wailord. These are the people of the damaged sea, and they will never abandon it."
    },
    {
        "description": "Gyarados is a good sweeper in OU due to its access to an excellent boosting move in Dragon Dance alongside solid offensive stats and a sterling offensive typing. It also has two extremely useful abilities in Moxie and Intimidate, which can allow it to snowball and aid it in setting up, respectively. Gyarados's decent bulk and good defensive typing provide it multiple setup opportunities and let it take hits from premier Pokemon in the tier such as Protean Greninja as well as Mega Swampert. However, Gyarados is hurt by its lackluster Speed tier, with Pokemon like Tapu Lele and Kyurem-B outspeeding it before a boost and most common Choice Scarf users and ultra-fast Pokemon like Mega Alakazam outspeeding it after a boost. Gyarados can also run a Mega set, which is notably trickier for some Choice Scarf users such as Garchomp to revenge kill, but it struggles with the prevalence of checks like Tangrowth and Toxapex."
    },
    {
        "description": "Lapras is an unviable choice in PU. Despite decent stats and a passable offensive movepool letting it function as a rather threatening Choice Specs user, it is wholly outclassed by Jellicent; besides having the same Special Attack and Speed stats and a similar ability in Water Absorb, Jellicent has a broader offensive movepool and a considerably better defensive typing that lets it check prominent threats that force Lapras out, such as Primeape and Gurdurr. Jellicent's rich support movepool, which includes Taunt, Recover, and Trick Room, also allows it to run other offensive sets successfully without being constrained to Choice Specs. Lapras is also heavily outclassed by other offensive Water- and Ice-types such as Ludicolo, Aurorus, and Jynx which are considerably more threatening and can provide utility in weather, entry hazards, and speed control, making them much easier to fit on teams."
    },
    {
        "description": "The combination of Imposter and Choice Scarf allows Ditto to function as a formidable revenge killer, punishing opposing setup sweepers by copying them and their boosts while also outspeeding them thanks to Choice Scarf."
    },
    {
        "description": "Eevee being frail and slow can make it hard for it to get a boost, meaning that it needs dedicated support to function."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Although Jolteon's slightly higher Speed compared to Raikou might seem enticing, its barren movepool, non-existent bulk, and lack of access to Calm Mind makes it offensively outclassed by its brethren. Other very fast Pokemon such as Swellow, Ribombee, or Mega Sceptile also outclass it in its revenge killing and pivoting roles; the only unique thing it has that stands out is the ability to force switches with a combination of Yawn and Volt Switch; however, this niche is very hard to pull off and not appreciated by most teams."
    },
    {
        "description": "Flareon might look good to use based on its excellent Attack and good Special Defense stats. However, its horrid Speed and shallow movepool make it hard to use. Furthermore, it has no defensive utility outside of Flash Fire due to its bad defensive typing, vulnerability to hazards, and inability to switch into unresisted attacks. Flareon is one of the few Fire-types in the tier, as well as one of the fewer physical Fire-types, which gives it a small niche; however, it struggles to be a good wallbreaker due to its low Speed stat and the recoil from Flare Blitz. It is outclassed by other wallbreakers like Combusken, Stoutland, and Dodrio due to their better Speed stats and movepools."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Omanyte has a rock-solid place in the LC metagame thanks to its high Defense, which gives it many setup opportunities, coupled with its high Special Attack, which allows it to pressure the opponent's team at the same time. Omanyte is able to perform two very different roles, each with different counterplay, which gives it a certain measure of unpredictability. First, it can run a Shell Smash set, allowing it to boost its already-high Special Attack and sweep teams in the late-game. Alternatively, it can adopt a supporting role, using Weak Armor to boost its Speed and its wide support movepool to set entry hazards and disrupt the opposing team. In addition, Omanyte's typing gives it key resistances to Flying- and Fire-type moves, but it also gives it weaknesses to the more common Electric-, Grass-, and Fighting-type moves. Omanyte is also held back by its poor Speed, which leaves it reliant on either a Weak Armor or Shell Smash boost to perform its role effectively, and its lack of priority, leaving it susceptible to certain revenge killers."
    },
    {
        "description": "Omastar's vast movepool, high Special Attack, and access to Shell Smash make it a threatening setup sweeper able to muscle through common special walls like Cryogonal and Audino and Water-type checks such as Lanturn and Jellicent depending on its Z-Crystal. Its decently high Defense and typing give it plenty of setup opportunities against threats like Silvally-Fairy, Alolan Sandslash, and Skuntank. This allows it to take full advantage of its ability Weak Armor, which allows it to outspeed common revenge killers such as Choice Scarf Primeape. Omastar's typing also allows it to force out defensive Pokemon like Regirock, giving it more setup opportunities. Moreover, its access to both Spikes and Stealth Rock makes it a potent lead on more offensive teams, which is further enhanced by its ability to threaten most Defoggers and spinners such as Lurantis, Articuno, and Cryogonal depending on what it decides to run. However, Omastar's typing grants it weaknesses to common typings like Fighting, Ground, and Grass, which, when combined with its atrocious special bulk, give it a harder time setting up and make it easy to revenge kill with moves like Mach Punch. Due to its poor Speed, it remains slower than Choice Scarf users like Primeape even after a Shell Smash, meaning it often can be reliant on triggering Weak Armor and left easier to pick off with a priority move like Sucker Punch. Omastar's Speed also hinders its job as a lead, as most Defoggers and spinners outspeed it and threaten it if it isn't running the right coverage. Lastly, Omastar suffers from competition with Carracosta and Ludicolo as sweepers, with the former carrying Aqua Jet and having better bulk, making it harder to revenge kill, and the latter having a superior Speed tier, typing, and movepool. As a lead, Lycanroc is considerably faster and has access to Taunt and Endeavor, while Qwilfish is also faster and has a superior typing along with Intimidate."
    },
    {
        "description": "Kabuto has a niche in being a Rapid Spin user that can also set up Stealth Rock, allowing it to perform two major roles in a team. Kabuto also has access to Knock Off, which allows it to remove foes' Eviolites and hit the Ghost-types that try and block Rapid Spin. Its useful Water typing allows it to beat many common leads like Onix and Dwebble, as well as giving it resistances to common types like Fire, Poison, and Flying. With a solid Defense stat and Rock typing, Kabuto becomes a decent Flying-type check; while it is weak to Fighting, Kabuto survives a Jump Kick from Doduo, a Superpower from Bulk Up Rufflet, and two Knock Offs from Vullaby while OHKOing Doduo and Rufflet and 2HKOing Vullaby with Rock Slide. Kabuto has a good Attack stat that allows it to beat Drilbur and Life Orb Diglett with Waterfall. After it is activated, Weak Armor allows Kabuto to outspeed Pokemon such as Doduo and Rufflet. Despite its good defensive prowess, its special bulk is lackluster, making it lose to many mixed and special attackers like Staryu, Foongus, and Spritzee. While it is a decent Flying-type check, a poor defensive typing also gives it weaknesses to common Fighting-, Electric-, and Grass-type moves. Kabuto also faces competition from other Rapid Spin users such as Staryu and Drilbur and other Stealth Rock setters such as Dwebble and Onix, which have better Speed stats, offensive presences, and defensive typings."
    },
    {
        "description": "Kabutops is a solid Choice Scarf user that has plenty of utility in checking top threats such as Oricorio-E due to its unique combination of typing and Speed. Unlike most Choice Scarf users, it functions more as a utility revenge killer, with excellent support options such as Rapid Spin and Knock Off, and not as a check to most setup sweepers due to its mediocre base Speed. Kabutops is also notable for its role on rain teams, as its solid Speed, decent Attack, access to Swords Dance, and excellent STAB combination all make it highly suited to become one of the tier's top rain sweepers. Kabutops gets by on key resistances to Fire, Flying, Ice, and Normal, but its typing is a double-edged sword, leaving it with common weaknesses to Fighting, Ground, Electric, and Grass. This leaves it vulnerable to many coverage moves such as Kangaskhan's Earthquake and Dodrio's Jump Kick, and this can often limit its opportunities for setup or revenge killing. Additionally, outside of rain, Kabutops is prone to being revenge killed by common Choice Scarf users such as Primeape and Dodrio and struggles with how common Mach Punch Hitmonchan and Gurdurr are. Ultimately, Kabutops faces a lot of competition from faster Choice Scarf users such as Dodrio, Primeape, and Swanna, which are far more capable at revenge killing, and only sets itself apart with its unique set of resistances and ability to remove entry hazards."
    },
    {
        "description": "Mega Aerodactyl is one of the most dominant offensive Pokemon in the UU metagame thanks to its combination of speed, power, and versatility, allowing it to fit on every team archetype. Its immense base 150 Speed makes it the fastest unboosted Pokemon in the tier. A sizable base 135 Attack coupled with Tough Claws and a wide arsenal of moves, such as Stone Edge, Earthquake, Ice Fang, and Pursuit, allows Mega Aerodactyl to hit a vast amount of Pokemon in the tier super effectively. Pursuit lets it trap common Pokemon, such as Latias, Gengar, and Celebi. However, even with its vast movepool, Mega Aerodactyl still does not possess the necessary firepower to break through some of UU's bulkier walls, such as Swampert and Mega Aggron. Mega Aerodactyl is also susceptible to Stealth Rock due to its part Flying typing and weak to the powerful priority moves that flood the UU metagame, such as Bullet Punch from Scizor and Ice Shard from Mamoswine, meaning that it can be worn down rather easily when not packing Roost. Lastly, Mega Aerodactyl is outsped by common Choice Scarf users such as Krookodile and Hydreigon, which can revenge kill it after Stealth Rock damage."
    },
    {
        "description": "As Snorlax continues to descend into lower tiers, it brings with it its tried-and-true Curse sets and manages to establish its perpetual dominance in the SM RU metagame as evident by its influential and consistent roles as a setup sweeper, wallbreaker, and defensive threat. Snorlax's Thick Fat ability in conjunction with its defensive stats allows it to check a variety of Pokemon, such as Nidoqueen, Salazzle, and Mega Glalie, while its ability to make use of Curse further bolsters its defensive prowess and enables it to sweep. Figy Berry opens up the option for a different spin on its conventional Curse set, making use of it with Gluttony and Recycle to give Snorlax a tool that capitalizes on its matchup versus offensive teams. Along with three great abilities, Snorlax possesses a movepool that complements its job as a wallbreaker and defensive Pokemon, granting it access to Pursuit, which can dispose of frail attackers like Swellow, Mismagius, and Espeon, alongside the necessary coverage moves and STAB attacks to break through physically bulky Pokemon such as Slowbro and Metagross. Snorlax, however, is forced to rely either on Rest, which oftentimes puts in situations where it has to compromise its team's momentum to stay in the game, or Recycle + Figy Berry, which makes it susceptible to status; its relatively low Speed means it will often be too offensively pressured to rely on these recovery options. Sets not using any form of recovery will usually be overwhelmed quickly, and Snorlax has a number of counters that can hold back its sweeper and Choice Band sets, requiring its teammates to provide additional support."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Good base stats and a nice defensive typing let Zapdos check many prominent threats like Kartana, Tornadus-T, and Sand Rush Excadrill. Two useful abilities in Static and Pressure further increase Zapdos's utility by either crippling contact attackers like Mega Medicham, Kartana, and Mega Lopunny or stalling out entry hazard setters like Ferrothorn and Clefable. In addition, great coverage options in Hidden Power Ice and Heat Wave prevent Zapdos from being fodder for common threats like Landorus-T, Garchomp, and Ferrothorn. Unfortunately, the weakness to Stealth Rock cripples Zapdos's defensive capabilities and forces it to waste a turn on using Roost more often. Also, many common Pokemon have their ways to reliably beat Zapdos, like Garchomp with Continental Crush and Kartana with Swords Dance-boosted Breakneck Blitz."
    },
    {
        "description": "Moltres fits incredibly well in the tier and has the ability to fulfill roles nothing else can. Moltres's stats are solid by UU standards, and its typing is a mixed blessing: Fire / Flying provides fantastic offensive coverage, resistances to important types, such as Bug, Steel, Fighting, and Fire, and an immunity to Ground-type moves. However, Moltres is weak to Water-, Electric- and Rock-type moves, with the latter also bringing a 4x weakness to Stealth Rock, which is a significant inconvenience but is manageable thanks to the good availability of Defog users. Moltres's abilities also are rather niche, its movepool is somewhat limited, and it can be very one-dimensional and predictable, but despite this, it has all the tools it needs to be a major threat in the UU tier."
    },
    {
        "description": "Dratini is able to perform as both a threatening wallbreaker and a late-game cleaner due to its access to strong offensive moves like Draco Meteor, Iron Tail, and Extreme Speed and a strong setup option in Dragon Dance. Its two main options are a mixed attacking set that utilizes Dratini's high-Base Power moves and good coverage to weaken the opposing team for sweepers or clean late-game and a sweeping set that utilizes Dragon Dance, since +1 Dratini is both fast and strong enough to clean up weakened teams. Dratini also has a useful ability in Shed Skin, allowing it to occasionally cure itself of debilitating status conditions like paralysis and burn. Dratini's typing is a mixed blessing, sporting very useful resistances to Water- and Electric-type moves but leaving it weak to moderately common Fairy- and Ice-type attacks. Dratini's positive qualities are also offset by its average-at-best stats, with low bulk and only middling power and Speed before a boost. Dratini further suffers from having common counters such as Snubbull, Magnemite, and Spritzee."
    },
    {
        "description": "No movesets available."
    },
    {
        "description": "Dragonite is a devastating sweeper with Supersonic Skystrike, capable of breaking through defensive staples like Clefable, Tapu Fini, Ferrothorn, and Gliscor after a Dragon Dance. It can select from great priority, additional coverage, and recovery to best fit its team. Dragonite's ability Multiscale gives it an easy time setting up, but Stealth Rock takes away both Multiscale's effect and a chunk of Dragonite's health, so Dragonite requires good support against entry hazards to function well, either through exerting intense offensive pressure or with an emergency spinner or Defogger. A subpar Speed tier leaves Dragonite easily revenge killed, especially if it's chipped while setting up or if its team is unable to damage revenge killers into the range of Extreme Speed. Additionally, once Supersonic Skystrike is burned, Fly can be played around, leaving Dragonite reliant on non-STAB coverage. Finally, Dragonite faces serious competition from Mega Charizard X and even Gyarados, with both being more consistent options. As a result, Dragonite finds itself relegated to hyper offensive teams, where even there it struggles to find a place by nearly mandating anti-hazard support, constraining its team's builds."
    },
    {
        "description": "Mewtwo also faces competition from Deoxys-A and Ultra Necrozma as a fast Psychic-type wallbreaker. Deoxys-A is faster, whereas Ultra Necrozma has multiple sets and thus similar versatility, and both don't take up a Mega slot. However, Fire Blast helps Mewtwo differentiate itself from said Pokemon."
    },
    {
        "description": "Mew's niche in the UU tier stems from its diverse movepool and well-rounded stats, which allow it to fulfill the role of a stallbreaker or provide utility to its team in the form of Stealth Rock and Defog support. Mew's ability to outspeed most defensive Pokemon grants it multiple opportunities to get off a fast Taunt to limit bulkier Pokemon like Hippowdon, Pyukumuku, and Blissey from using their recovery moves or prevent Pokemon like Empoleon and Gligar from setting or removing entry hazards. Access to the combination of Seismic Toss and Taunt also allows Mew to beat almost every entry hazard user in the tier, including the likes of Empoleon, Rhyperior, and Mega Aggron, something very few Pokemon can claim. However, Mew is let down by its pure Psychic typing, which leaves it unable to effectively check a majority of offensive threats the UU tier has to offer, including staples such as Scizor, Bisharp, and Mega Sharpedo. This is worsened by its inability to carry coverage options outside of Seismic Toss and Knock Off effectively, making Mew extremely passive and easily exploited by threats like Infernape, Gengar, Facade Mega Altaria, and Hydreigon, the first of which it would be able to check with STAB coverage if its role permitted it. Mew is also susceptible to status moves like Toxic and Thunder Wave, which hinders it in its role as a stallbreaker and is especially troublesome for a Defog user, as its typing leaves it vulnerable to being worn down by every entry hazard. Mew struggles to deal with common threats like Hydreigon, Calm Mind Latias, and Celebi, as it is unable to punish them outside of Seismic Toss or status moves like Will-O-Wisp and Toxic, thus allowing the latter two to use Mew as a setup opportunity in most cases. Celebi in particular is able to shrug off all of Mew's responses through means like Recover, Giga Drain, and Natural Cure. Mew is also unable to run an offensive set, facing competition against other offensive Psychic-types such as Latias and Celebi, the latter of which, while sharing the same stat distribution, has a secondary typing to break through bulkier teams, unlike Mew."
    }
]